In [1]:
import pandas as pd

In [2]:
s = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
print(type(s))
print(s)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
d    4
dtype: int64

In [34]:
df = pd.DataFrame({"name": ['John', 'Doe', 'Karl'], 
                  "Age": [5, 6, None]}, index = ['one', 'two', 'three'])
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
       name  Age
one    John  5.0
two     Doe  6.0
three  Karl  NaN

In [ ]:
# pd.read_csv('file.csv')
# pd.read_excel('file.xlsx')
# pd.read_json('file.json')

# df.to_csv('save.csv', index = False)
# df.to_excel('save.xlsx')

In [5]:
df.head(1)

   name  Age
0  John    5

In [6]:
df.tail(1)

  name  Age
1  Doe    6

In [8]:
df.shape

(2, 2)

In [9]:
df.describe()

            Age
count  2.000000
mean   5.500000
std    0.707107
min    5.000000
25%    5.250000
50%    5.500000
75%    5.750000
max    6.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   Age     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes

In [12]:
df.dtypes

name    object
Age      int64
dtype: object

In [13]:
df.columns

Index(['name', 'Age'], dtype='object')

In [14]:
df['Age']

0    5
1    6
Name: Age, dtype: int64

In [15]:
df[['Age', 'name']]

   Age  name
0    5  John
1    6   Doe

In [20]:
df.iloc[0]

name    John
Age        5
Name: one, dtype: object

In [23]:
df.loc['one']

name    John
Age        5
Name: one, dtype: object

In [24]:
df.iloc[0:2]

     name  Age
one  John    5
two   Doe    6

In [25]:
df[df['Age'] > 5]

    name  Age
two  Doe    6

In [32]:
df.isnull()

        name    Age
one    False  False
two    False  False
three  False   True

In [33]:
df.dropna()

     name  Age
one  John  5.0
two   Doe  6.0

In [35]:
df.fillna(7)

       name  Age
one    John  5.0
two     Doe  6.0
three  Karl  7.0